### python과 mysql을 연동 
1. 외부의 라이브러리(pymysql) 설치
2. 라이브러리 로드 
3. sql 서버의 정보를 입력 
4. sql 서버에 접속
5. sql 쿼리문을 작성하여 sql 서버에 쿼리문을 질의
6. 해당하는 쿼리문에 따라 응답 메시지 dict 형태로 리턴

In [ ]:
# 외부의 라이브러리를 설치 
!pip install pymysql

In [ ]:
# 라이브러리 로드 
import pymysql

In [ ]:
# 서버의 정보를 입력하고 접속
_db = pymysql.connect(
    host='127.0.0.1',   ## 내 컴퓨터
    port = 3306,   ## 포트번호 입력(mysql 기본포트는 3306)
    user = 'root', ## 사용자의 ID
    password = '1234', ## 사용자의 패스워드
    db = 'ezen2'    ## 사용할 데이터베이스의 이름
)

In [ ]:
# Cursor 생성
cursor = _db.cursor(pymysql.cursors.DictCursor)
cursor2 = _db.cursor()

In [ ]:
# sql 쿼리문 작성 
sql = "select * from emp"

In [ ]:
# cursor를 이용하여 sql쿼리문을 질의 
cursor.execute(sql)

In [10]:
# 질의에 대한 답변을 로드 
cursor.fetchall()

[]

In [9]:
cursor2.execute(sql)
cursor2.fetchall()

((7369.0, 'SMITH', 'CLERK', 7902.0, '1980-12-17', 800.0, 0.0, 20.0),
 (7499.0, 'ALLEN', 'SALESMAN', 7698.0, '1981-02-20', 1600.0, 300.0, 30.0),
 (7521.0, 'WARD', 'SALESMAN', 7698.0, '1981-02-22', 1250.0, 500.0, 30.0),
 (7566.0, 'JONES', 'MANAGER', 7839.0, '1981-04-02', 2975.0, 0.0, 20.0),
 (7654.0, 'MARTIN', 'SALESMAN', 7698.0, '1981-09-28', 1250.0, 1400.0, 30.0),
 (7698.0, 'BLAKE', 'MANAGER', 7839.0, '1981-05-01', 2850.0, 0.0, 30.0),
 (7782.0, 'CLARK', 'MANAGER', 7839.0, '1981-06-09', 2450.0, 0.0, 10.0),
 (7788.0, 'SCOTT', 'ANALYST', 7566.0, '1987-06-28', 3000.0, 0.0, 20.0),
 (7839.0, 'KING', 'PRESIDENT', 0.0, '1981-11-17', 5000.0, 0.0, 10.0),
 (7844.0, 'TURNER', 'SALESMAN', 7698.0, '1981-09-08', 1500.0, 0.0, 30.0),
 (7876.0, 'ADAMS', 'CLERK', 7788.0, '1987-07-13', 1100.0, 0.0, 20.0),
 (7900.0, 'JAMES', 'CLERK', 7698.0, '1981-12-03', 950.0, 0.0, 30.0),
 (7902.0, 'FORD', 'ANALYST', 7566.0, '1981-12-03', 3000.0, 0.0, 20.0),
 (7934.0, 'MILLER', 'CLERK', 7782.0, '1982-01-23', 1300.0, 0.0, 10.0))

In [11]:
# 테이블 생성 
sql = """
    create table 
    user (
    id varchar(32) primary key, 
    password varchar(32) not null, 
    name varchar(32), 
    loc varchar(16)
    )
"""

In [12]:
cursor.execute(sql)

0

In [13]:
# table에 데이터를 삽입 
sql = """
    insert into 
    user 
    values 
    ('test', '1234', 'kim', 'seoul')
"""
cursor.execute(sql)

1

In [14]:
sql = """
    select * from user
"""
cursor.execute(sql)
cursor.fetchall()

[{'id': 'test', 'password': '1234', 'name': 'kim', 'loc': 'seoul'}]

In [15]:
# insert문을 이용하여 데이터를 삽입한 뒤 실제 데이터베이스에는 연동이 되지 않았다. 
# cursor 가상공간에 있는 데이터셋를 데이터베이스와 연동 
_db.commit()

In [16]:
input_id = input('아이디를 입력하시오')
input_pass = input('패스워드를 입력하시오')
input_name = input('이름을 입력하시오')
input_loc = input('사는 지역을 입력하시오')
print(input_id, input_pass, input_name, input_loc)

test2 1111 park seoul

In [17]:
# 유저가 입력한 데이터를 이용하여 데이터베이스에 데이터를 삽입
sql = f"""
    insert into 
    user 
    values 
    ({input_id}, {input_pass}, {input_name}, {input_loc})
"""
print(sql)

    insert into
    user
    values
    (test2, 1111, park, seoul)

In [18]:
sql = """
    insert into 
    user 
    values 
    (%s, %s, %s, %s)
"""
values = [input_id, input_pass, input_name, input_loc]
cursor.execute(sql, values)
_db.commit()

In [37]:
import pandas as pd

In [38]:
# sql 함수를 생성 
# select문인 경우에는 결과값을 dict형태로 받아온다. (execute -> fetchall)
# select문이 아닌 경우에는 데이터베이스와의 동기화(execute -> commit)
def sql_query(sql, *value):
    cursor.execute(sql, value)
    # sql이 select문인지 확인 
    # print(sql.strip().lower().startswith('select'))
    # print(value)
    if sql.strip().lower().startswith('select'):
        data = cursor.fetchall()
        result = pd.DataFrame(data)
    else:
        _db.commit()
        result = 'Query OK'
    return result

In [39]:
sql = """
    SELECT 
    * 
    from 
    user
"""

sql_query(sql)

      id password  name    loc
0   test     1234   kim  seoul
1  test2     1111  park  seoul

In [40]:
import mysql as ms

In [43]:
import imp 
imp.reload(ms)

C:\Users\EZEN\AppData\Local\Temp\ipykernel_12552\2401765371.py:1: DeprecationWarning: the imp module is deprecated in favour of importlib and slated for removal in Python 3.12; see the module's documentation for alternative uses
  import imp

In [41]:
# MyDB class생성
mydb1 = ms.MyDB()

In [42]:
# select문을 이용하여 데이터를 조회 
sql  = """
    select 
    * 
    from 
    emp
"""
mydb1.sql_query(sql)

     EMPNO   ENAME        JOB     MGR    HIREDATE     SAL    COMM  DEPTNO
0   7369.0   SMITH      CLERK  7902.0  1980-12-17   800.0     0.0    20.0
1   7499.0   ALLEN   SALESMAN  7698.0  1981-02-20  1600.0   300.0    30.0
2   7521.0    WARD   SALESMAN  7698.0  1981-02-22  1250.0   500.0    30.0
3   7566.0   JONES    MANAGER  7839.0  1981-04-02  2975.0     0.0    20.0
4   7654.0  MARTIN   SALESMAN  7698.0  1981-09-28  1250.0  1400.0    30.0
5   7698.0   BLAKE    MANAGER  7839.0  1981-05-01  2850.0     0.0    30.0
6   7782.0   CLARK    MANAGER  7839.0  1981-06-09  2450.0     0.0    10.0
7   7788.0   SCOTT    ANALYST  7566.0  1987-06-28  3000.0     0.0    20.0
8   7839.0    KING  PRESIDENT     0.0  1981-11-17  5000.0     0.0    10.0
9   7844.0  TURNER   SALESMAN  7698.0  1981-09-08  1500.0     0.0    30.0
10  7876.0   ADAMS      CLERK  7788.0  1987-07-13  1100.0     0.0    20.0
11  7900.0   JAMES      CLERK  7698.0  1981-12-03   950.0     0.0    30.0
12  7902.0    FORD    ANALYST  7566.0  1981-12-03  3000.0     0.0    20.0
13  7934.0  MILLER      CLERK  7782.0  1982-01-23  1300.0     0.0    10.0

In [44]:
mydb2 = ms.MyDB(
    'darkpreist.iptime.org', 
    3306, 
    'ubion', 
    '1234', 
    'ubion'
)

In [ ]:
sql = """
    select 
    * 
    from 
    `sales records`
"""
mydb2.sql_query(sql)

In [48]:
mydb1.sql_query(sql)

ProgrammingError: (1146, "Table 'ezen2.sales records' doesn't exist")